/*ДЗ 1 Без А

Напишіть регулярний вираз, який допоможе знайти принаймні шість символів і не містяти літери А (великої або малої)

Умови виконання ДЗ
Не використовувати функції або інші матеріали які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки
Будь ласка, надайте наступні дані для перевірки вашої роботи:
Створіть гілку js_homework7.
Додати туди ваше домашне завдання
Вислати вашу гілку*/

/*var str = "test_regul" ;
let re = /^(?!.*[Aa])[^\s]{6,}$/;
console.log(re.test(str))*/

/*ДЗ 2 Параноя

В нас є масив обєктів в яких міститься email.
У нас параноя, ми не довіряємо жодним адресам, окрім зареєстрованих на доменах gmail.com та yahoo.com.
За допомогою регулярного виразу створіть масив з адресами, гідними довіри.
Постарайтеся також зробити просту валідацію до @
одне, або два слова які можуть містити (латинські букви, цифри) яке може бути розділене крапкою.

Умови виконання ДЗ
Не використовувати функції або інші матеріали які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки
Будь ласка, надайте наступні дані для перевірки вашої роботи:
Створіть гілку js_homework7.
Додати туди ваше домашне завдання
Вислати вашу гілку*/

let arr = [
    {
        userName: "Test",
        lastName: "Test",
        email: "test.test@gmail.com"
    },
    {
        userName: "Dmitro",
        lastName: "Porohov",
        email: "dmitro.porohov@yahoo.com"
    },
    {
        userName: "Andrii",
        lastName: "",
        email: "andrii@mail.ru" // Нам такі не підходять
    },
];

let trustedEmails = arr.filter(item => {
    // Валідація до символу @
    if (!/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(item.email)) {
        return false;
    }
    // Перевірка домену
    if (/@(gmail|yahoo)\.com$/.test(item.email)) {
        return true;
    }
    return false;
});

console.log(trustedEmails);